ambiot/amazon-freertos/lib/third_party/mcu_vendor/realtek/component/common/bluetooth/realtek/sdk/board/amebaz2/src/rtl8710c_bt_calibration.c
#include <drv_types.h>
#include <hal_data.h>
#include "rtl8710c_bt_calibration.h"
#include "hal_sys_ctrl.h"

#ifdef CHIP_VER
#undef CHIP_VER  /* CHIP_VER in hal_com_reg.h conflicts with CHIP_VER in platform_conf.h */
#ifdef _PLATFORM_CONF_H_
#undef _PLATFORM_CONF_H_ /* undef _PLATFORM_CONF_H_ to define CHIP_VER in platform_conf.h again */
#include "platform_conf.h"
#endif //#ifdef _PLATFORM_CONF_H_
#endif //#ifdef CHIP_VER

#include "flash_api.h"

#define DBG_BT_CALIBRATION				(0) // Debug log, default close

#define FLASH_BT_PARA_ADDR				(SYS_DATA_FLASH_BASE + 0xFF0)
#define BT_IQK_CANDIDATE_NUM			(3)
#define BT_IQK_MAX_RETRY				(2)
#define BT_DCK_TOLERANCE				(1) // Suggested by RDC BiChing
#define BT_IQK_TOLERANCE				(2) // Suggested by BT Jeffery
#define BT_IQK_BACKUP_BB_REG_NUM		(8)
#define BT_IQK_BACKUP_RF_REG_NUM		(3)
#define BT_IQK_DELAY_TIME				(20)
#define BT_DCK_BIT_LEN					(9)
#define BT_IQK_BIT_LEN					(10)
#define BT_LOK_BIT_LEN					(6)

extern int GNT_BT_to_wifi(void);
extern void disable_pta(void);
extern Rltk_wlan_t	rltk_wlan_info[NET_IF_NUM];

void _bt_backup_bb_registers_8710c(struct dm_struct *dm,
								  uint32_t *reg,
								  uint32_t *backup_val,
								  uint32_t register_num)
{
	for (uint32_t i = 0; i < register_num; i++)
		backup_val[i] = odm_get_bb_reg(dm, reg[i], MASKDWORD);
}

void _bt_backup_rf_registers_8710c(struct dm_struct *dm,
								  uint32_t *reg,
								  uint32_t *backup_val,
								  uint32_t register_num)
{
	for (uint32_t i = 0; i < register_num; i++)
		backup_val[i] = odm_get_rf_reg(dm, RF_PATH_A, reg[i], RFREG_MASK);
}

void _bt_reload_bb_registers_8710c(struct dm_struct *dm,
								  uint32_t *reg,
								  uint32_t *backup_val,
								  uint32_t register_num)
{
	for (uint32_t i = 0; i < register_num; i++)
		odm_set_bb_reg(dm, reg[i], MASKDWORD, backup_val[i]);
}

void _bt_reload_rf_registers_8710c(struct dm_struct *dm,
								  uint32_t *reg,
								  uint32_t *backup_val,
								  uint32_t register_num)
{
	for (uint32_t i = 0; i < register_num; i++)
		odm_set_rf_reg(dm, RF_PATH_A, reg[i], RFREG_MASK, backup_val[i]);
}


int16_t signed_value_conversion(uint16_t val, uint8_t bit_len)
{
	int16_t sign_bit = 1 << (bit_len-1);
	int16_t value_mask = (1 << (bit_len-1)) - 1;
	if (val & sign_bit) { // val < 0
		int16_t twos_complement_val = ((~val) & value_mask) + 1;
		return -(twos_complement_val);
	}
	else
		return val;
}


BT_Cali_TypeDef calibration_data_conversion_struct(uint64_t result_u64)
{
	BT_Cali_TypeDef result;	
	result.IQK_xx = (result_u64 >> 34) & 0x3FF;
	result.IQK_yy = (result_u64 >> 24) & 0x3FF;
	result.IDAC = (result_u64 >> 18) & 0x3F;
	result.QDAC = (result_u64 >> 12) & 0x3F;
	result.IDAC2 = (result_u64 >> 6) & 0x3F;
	result.QDAC2 = (result_u64 >> 0) & 0x3F;
	return result;
}

uint64_t calibration_data_conversion_u64(BT_Cali_TypeDef cal_data)
{
	uint64_t result = ((uint64_t)cal_data.IQK_xx << 34) | ((uint64_t)cal_data.IQK_yy << 24) | (cal_data.IDAC << 18) | (cal_data.QDAC << 12) | (cal_data.IDAC2 << 6) | (cal_data.QDAC2);
	return result;
}

void sort_iqk(uint32_t* iqk_array, int num)
{
	uint32_t temp;
	int i, j;
	int16_t val_i, val_j;
	
	for (i = 0; i < (num - 1); i++) {
		val_i = signed_value_conversion(iqk_array[i], BT_IQK_BIT_LEN);
		for (j = (i + 1); j < num; j++) {
			val_j = signed_value_conversion(iqk_array[j], BT_IQK_BIT_LEN);
			if (val_i > val_j) {
				temp = iqk_array[i];
				iqk_array[i] = iqk_array[j];
				iqk_array[j] = temp;
				val_i = signed_value_conversion(iqk_array[i], BT_IQK_BIT_LEN);
			}
		}
	}
}

void sort_lok(uint16_t* lok_array, int num)
{
	uint16_t temp;
	int i, j;
	
	for (i = 0; i < (num - 1); i++) {
		for (j = (i + 1); j < num; j++) { 
			if (lok_array[i] > lok_array[j]) {
				temp = lok_array[i];
				lok_array[i] = lok_array[j];
				lok_array[j] = temp;
			}
		}
	}
}


bool bt_calibration_similar(uint16_t a, uint16_t b, uint8_t bit_len, uint8_t tolerance, bool signed_val)
{
	int16_t val_a = (signed_val)? signed_value_conversion(a, bit_len): a;
	int16_t val_b = (signed_val)? signed_value_conversion(b, bit_len): b;
	
	uint16_t diff = (val_a > val_b) ? (val_a - val_b) : (val_b - val_a);
	
	if (diff <= tolerance) {
		return true;
	}
	else {
		return false;
	}
}

uint64_t phy_bt_iqk_lok_8710c(void *dm_void)
{
	struct dm_struct *dm = (struct dm_struct *)dm_void;
	uint32_t btiqk_x, btiqk_y, btlok_x, btlok_y, btlok2_x, btlok2_y;
	uint64_t result;
	uint32_t t = 0;
	
	/*1.AmebaZII_TXLOKIQK_TEST.txt */
	//BB setting, save original value
	odm_set_bb_reg(dm, R_0x88c, 0x00f00000, 0xf);
	odm_set_bb_reg(dm, R_0x874, MASKDWORD, 0x25205000);	//[21] 0x1
	odm_set_bb_reg(dm, R_0xc08, MASKDWORD, 0x800e4);	//[19] 0x1
	odm_set_bb_reg(dm, R_0xc04, MASKDWORD, 0x03a05601);
	
	// AFE set BT mode
	odm_set_bb_reg(dm, R_0x888, MASKDWORD, 0x000000cb);
	
	odm_set_bb_reg(dm, R_0xe28, BIT31, 0x0);
	odm_set_bb_reg(dm, R_0xe28, BIT23, 0x0);
	odm_set_rf_reg(dm, RF_PATH_A, RF_0xdf, BIT1, 0x0);			// WIFI TX Gain debug
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x56, 0x00000fff, 0xee8);	// WIFI TX Gain [11:0]
	
	// ===========================
	odm_set_rf_reg(dm, RF_PATH_A, RF_0xde, BIT16, 0x1);		// BT TX Gain debug
	odm_set_rf_reg(dm, RF_PATH_A, 0x06, 0x00003000, 0x3);		// DAC Gain [13:12]
	odm_set_rf_reg(dm, RF_PATH_A, 0x06, 0x00000E00, 0x2);		// IPA [11:9]
	odm_set_rf_reg(dm, RF_PATH_A, 0x06, 0x000001E0, 0x3);		// PAD [8:5]
	odm_set_rf_reg(dm, RF_PATH_A, 0x06, 0x0000001F, 0x2);		// TXBB [4:0] // 20190610: BT Jeffery: mapping TX gain table 4.5dBm
	// ===========================
	odm_set_rf_reg(dm, RF_PATH_A, RF_0xef, BIT3, 0x1);
	//ADDA on//
	odm_set_bb_reg(dm, R_0xe70, MASKDWORD, 0x03c00016);
	//-----------------------------//
	
	//IQK & LOK setting
	odm_set_bb_reg(dm, R_0xe28, MASKDWORD, 0x00800044);	//e28[23]:iqk-adda
	//path-A IQK setting
	odm_set_bb_reg(dm, R_0xe30, MASKDWORD, 0x1800cc08);	//tx-tone-id[9:0] , TX-cal-M[29]
	odm_set_bb_reg(dm, R_0xe34, MASKDWORD, 0x3800cc08);	//rx-tone-id[9:0] , RX-cal-M[29]
	odm_set_bb_reg(dm, R_0xe50, MASKDWORD, 0x3800cc08);	//tx-tone-id[9:0] , TX-cal-M[29]
	odm_set_bb_reg(dm, R_0xe54, MASKDWORD, 0x3800cc08);	//rx-tone-id[9:0] , RX-cal-M[29]
	odm_set_bb_reg(dm, R_0xe38, MASKDWORD, 0x821403e8);	//TX-PI-data 
	odm_set_bb_reg(dm, R_0xe3c, MASKDWORD, 0x68160c06);	//RX-PI-data
	odm_set_bb_reg(dm, R_0xe40, MASKDWORD, 0x01007c00);	//tx-stpz=01, X=1,Y=0, TX-XY-Mask[31] 
	odm_set_bb_reg(dm, R_0xe44, MASKDWORD, 0x01004800);	//rx-stpz=00, X=1,Y=0, RX-XY-Mask[31]
	odm_set_bb_reg(dm, R_0xe4c, MASKDWORD, 0x00462911);	//idac_cal_msk:4c[15]
	
	// ====== Set BTRF =====
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x18, 0x00003000, 0x0); //[17:16]
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x33, MASKDWORD, 0x00040);
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x1, BIT2, 0x1);
	odm_set_rf_reg(dm, RF_PATH_A, 0x20, BIT5, 0x1);
	// ====== Set BTRF =====
	
