ambiot/amazon-freertos/lib/third_party/mcu_vendor/realtek/component/common/bluetooth/realtek/sdk/board/amebaz2/src/rtl8710c_bt_calibration.c
	odm_set_bb_reg(dm, R_0xe28, MASKDWORD, 0x80800044);	//e28[23]:iqk-adda
	// ----- one shot -----//
	odm_set_bb_reg(dm, R_0xe48, MASKDWORD, 0xf9000800);
	odm_set_bb_reg(dm, R_0xe48, MASKDWORD, 0xf8000800);
	//---------------------//
	
	ODM_delay_ms(16);
	while ((odm_get_bb_reg(dm, R_0xeac, BIT26) != 1) && (t < 20000)) {
		ODM_delay_us(50);
		t += 50;
	}
	
	/*12_Read_Tx_X_Tx_Y*/
	btiqk_x = odm_get_bb_reg(dm, R_0xe94, 0x03FF0000);	//r_TX_X : e94[25:16]
	btiqk_y = odm_get_bb_reg(dm, R_0xe9c, 0x03FF0000);	//r_TX_Y : e9c[25:16]
	
	RF_DBG(dm, DBG_RF_IQK, "btiqk_x = 0x%x, btiqk_y = 0x%x, iqkend = 0x%x/n", 
		btiqk_x,
		btiqk_y,
		odm_get_bb_reg(dm, R_0xeac, BIT26));
	
	/*13_Read_IQDAC */
	odm_set_bb_reg(dm, R_0xe28, MASKDWORD, 0x800044);  //e28[23]:iqk-adda
	btlok_x = odm_get_rf_reg(dm, RF_PATH_A, RF_0x08, 0xFC000); //[19:14]
	btlok_y = odm_get_rf_reg(dm, RF_PATH_A, RF_0x08, 0x003F0); //[9:4]
	
	// second LOK
	odm_set_rf_reg(dm, RF_PATH_A, 0x06, 0x1E0, 0x6);       //PAD[8:5]
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x33, MASKDWORD, 0x0);
	odm_set_bb_reg(dm, R_0xe28, MASKDWORD, 0x80800044);  //e28[23]:iqk-adda
	// ----- one shot -----//
	odm_set_bb_reg(dm, R_0xe48, MASKDWORD, 0xf9000800);
	odm_set_bb_reg(dm, R_0xe48, MASKDWORD, 0xf8000800);
	//---------------------//
	
	t = 0;
	ODM_delay_ms(16);
	while ((odm_get_bb_reg(dm, R_0xeac, BIT26) != 1) && (t < 20000)) {
		ODM_delay_us(50);
		t += 50;
	}
	odm_set_bb_reg(dm, R_0xe28, MASKDWORD, 0x800044);  //e28[23]:iqk-adda
	btlok2_x = odm_get_rf_reg(dm, RF_PATH_A, RF_0x08, 0xFC000); //[19:14]
	btlok2_y = odm_get_rf_reg(dm, RF_PATH_A, RF_0x08, 0x003F0); //[9:4]
	
	/*14_restore_BTRF_setting_20181024*/
	odm_set_bb_reg(dm, R_0x88c, MASKDWORD, 0xcc0400c0); // 20190306 Added by BT Allen Hsu
	odm_set_bb_reg(dm, R_0x888, MASKDWORD, 0x00000003); //ad and da config to WIFI
	
	odm_set_rf_reg(dm, RF_PATH_A, RF_0xde, BIT16, 0x0);
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x1, BIT2, 0x0);
	odm_set_rf_reg(dm, RF_PATH_A, RF_0xef, BIT3, 0x0);
	
	odm_set_bb_reg(dm, R_0xc08, MASKDWORD, 0x000000e4);	// 20190326, Added by RDC Hillo
	odm_set_bb_reg(dm, R_0xc04, MASKDWORD, 0x03a05611); // 20190326, Added by RDC Hillo
	
	result = ((uint64_t)btiqk_x << 34) | ((uint64_t)btiqk_y << 24) | (btlok_x << 18) | (btlok_y << 12) | (btlok2_x << 6) | (btlok2_y);
	return result;
}

void phy_bt_lok_write_8710c(struct dm_struct *dm, uint16_t idac, uint16_t qdac, uint16_t idac2, uint16_t qdac2)
{
	odm_set_rf_reg(dm, RF_PATH_A, RF_0xef, BIT3, 0x1);			//LOK Write EN 0xEF[3]=1b
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x33, BIT6, 0x1);			//LOK for BT -> 0x33[6]=1b
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x08, 0xfc000, idac);
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x08, 0x003f0, qdac);
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x33, BIT6, 0x0);			//LOK2 for BT -> 0x33[6]=0b
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x08, 0xfc000, idac2);
	odm_set_rf_reg(dm, RF_PATH_A, RF_0x08, 0x003f0, qdac2);
	odm_set_rf_reg(dm, RF_PATH_A, RF_0xef, BIT3, 0x0);			//Close LOK Write EN
}

void phy_bt_adda_dck_8710c(void *dm_void)
{
	//printf("\n\rphy_bt_adda_dck_8710c---------------->\n\r");
	struct dm_struct *dm = (struct dm_struct *)dm_void;
	uint32_t t = 0, dck_cnt = 0;
	uint8_t dck_ok = 0;
	uint16_t adci, adcq, dai_adci, daq_adcq;
	
	while (!dck_ok) {
		RF_DBG(dm, DBG_RF_IQK, "[BT DCK]ADC offset mark off!!");
		
		/*01_DAC_DCK_ADC_offset_mark_off_20181024*/
		odm_set_bb_reg(dm, R_0x88c, MASKDWORD, 0xccf000c0);
		odm_set_bb_reg(dm, R_0xc80, MASKDWORD, 0x40000100);
		odm_set_bb_reg(dm, R_0xe6c, MASKDWORD, 0x03c00016);
		odm_set_bb_reg(dm, R_0xe70, MASKDWORD, 0x03c00016);
		odm_set_bb_reg(dm, R_0xc04, MASKDWORD, 0x03a05601);
		odm_set_bb_reg(dm, R_0xc08, MASKDWORD, 0x000800e4);
		odm_set_bb_reg(dm, R_0x874, MASKDWORD, 0x25204000);
		odm_set_bb_reg(dm, R_0x888, MASKDWORD, 0x0000008b);
		
		odm_set_bb_reg(dm, R_0x950, 0x01ff01ff, 0x00);
		odm_set_bb_reg(dm, R_0x818, 0x00400000, 0x0);
		odm_set_bb_reg(dm, R_0x990, 0x40000000, 0x1);
		
		odm_set_bb_reg(dm, R_0x880, 0x00000002, 0x0);	// RX BB to AD off
		ODM_delay_ms(25);  // without this delay, BT LOK may fail (still don't know why) (Debugged with RDC BiChing)
		
		odm_set_bb_reg(dm, R_0x880, 0x00000010, 0x1);
		odm_set_bb_reg(dm, R_0x880, 0x00008000, 0x1);
		odm_set_bb_reg(dm, R_0x880, 0x00010000, 0x0);
		odm_set_bb_reg(dm, R_0x880, 0x00020000, 0x1);
		odm_set_bb_reg(dm, R_0x888, 0x00000020, 0x0);
		
		odm_set_bb_reg(dm, R_0xe28, 0x00000008, 0x1);
		odm_set_bb_reg(dm, R_0xe48, 0x00f00000, 0x1);
		odm_set_bb_reg(dm, R_0xe48, 0x00000002, 0x0);
		odm_set_bb_reg(dm, R_0x908, 0x00000fff, 0x300);
		
		odm_set_bb_reg(dm, R_0x990, 0x80000000, 0x0);
		
		ODM_delay_us(1);
		
		odm_set_bb_reg(dm, R_0x990, 0x80000000, 0x1);
		
		// read 0xdf4[9:1]    ADCI offset
		adci = odm_get_bb_reg(dm, R_0xdf4, 0x000003FE);
		// read 0xdf4[31:23]  ADCQ offset
		adcq = odm_get_bb_reg(dm, R_0xdf4, 0xFF800000);
		
		RF_DBG(dm, DBG_RF_IQK, "[BT DCK]BT DAC mark off!!");
		
		/*04_DAC_DCK_mark_off_20181024*/
		odm_set_bb_reg(dm, R_0x88c, MASKDWORD, 0xccf000c0);
		odm_set_bb_reg(dm, R_0xc80, MASKDWORD, 0x40000100);
		odm_set_bb_reg(dm, R_0xe6c, MASKDWORD, 0x03c00016);
		odm_set_bb_reg(dm, R_0xe70, MASKDWORD, 0x03c00016);
		odm_set_bb_reg(dm, R_0xc04, MASKDWORD, 0x03a05601);
		odm_set_bb_reg(dm, R_0xc08, MASKDWORD, 0x000800e4);
		odm_set_bb_reg(dm, R_0x874, MASKDWORD, 0x25204000);
		odm_set_bb_reg(dm, R_0x888, MASKDWORD, 0x0000008b);
		
		odm_set_bb_reg(dm, R_0x818, 0x00400000, 0x0);
		odm_set_bb_reg(dm, R_0x990, 0x40000000, 0x1);
		
		odm_set_bb_reg(dm, R_0x880, 0x00000002, 0x0);
		odm_set_bb_reg(dm, R_0x880, 0x00000010, 0x0);
		odm_set_bb_reg(dm, R_0x880, 0x00008000, 0x0);
		odm_set_bb_reg(dm, R_0x880, 0x00010000, 0x1);
		odm_set_bb_reg(dm, R_0x880, 0x00020000, 0x1);
		odm_set_bb_reg(dm, R_0x888, 0x00000020, 0x1);
		
		ODM_delay_us(1);
		
		odm_set_bb_reg(dm, 0x988, MASKDWORD, 0x0003FFF0);
		odm_set_bb_reg(dm, R_0x98c, MASKDWORD, 0x00000000);
		odm_set_bb_reg(dm, R_0x994, MASKDWORD, 0x0003FFF0);
		odm_set_bb_reg(dm, R_0x998, MASKDWORD, 0x00000000);
		
		odm_set_bb_reg(dm, 0x988, 0x80000000, 0x1);
		odm_set_bb_reg(dm, R_0x994, 0x80000000, 0x1);
		
		odm_set_bb_reg(dm, 0x988, 0x40000000, 0x0);
		odm_set_bb_reg(dm, R_0x994, 0x40000000, 0x0);
		
		odm_set_bb_reg(dm, 0x988, 0x00000001, 0x1);	//pow_da_I_CR
		odm_set_bb_reg(dm, R_0x994, 0x00000001, 0x1);	//pow_da_Q_CR
		
		odm_set_bb_reg(dm, 0x988, 0x00000002, 0x1);	//cal_os_I_CR
		odm_set_bb_reg(dm, R_0x994, 0x00000002, 0x1);	//cal_os_Q_CR
		
		ODM_delay_us(350);
		while ((odm_get_bb_reg(dm, 0xfec, BIT31) != 1) && (t < 1000)) {
			ODM_delay_us(5);
			t += 5;
		}
		
		odm_set_bb_reg(dm, 0x988, 0x00000001, 0x0);	//pow_da_I_CR
		
		while ((odm_get_bb_reg(dm, 0xff8, BIT31) != 1) && (t < 1000)) {
			ODM_delay_us(5);
			t += 5;
		}
		odm_set_bb_reg(dm, R_0x994, 0x00000001, 0x0);	//pow_da_Q_CR
		
		// read 0xdf4[9:1]    ADCI offset
		dai_adci = odm_get_bb_reg(dm, R_0xdf4, 0x000003FE);
		// read 0xdf4[31:23]  ADCQ offset
		daq_adcq = odm_get_bb_reg(dm, R_0xdf4, 0xFF800000);
		
