ambiot/amazon-freertos/lib/third_party/mcu_vendor/realtek/component/common/bluetooth/realtek/sdk/board/amebaz2/src/rtl8710c_bt_calibration.c
		/*return to normal setting*/
		odm_set_bb_reg(dm, R_0x880, 0x00000002, 0x1);
		odm_set_bb_reg(dm, R_0x880, 0x00000010, 0x1);
		odm_set_bb_reg(dm, R_0x880, 0x00010000, 0x0);
		odm_set_bb_reg(dm, R_0x880, 0x00020000, 0x0);
		odm_set_bb_reg(dm, R_0x888, 0x00000020, 0x0);
		
		odm_set_bb_reg(dm, R_0x888, MASKDWORD, 0x00000003);
		
		dck_cnt++;
		
		if ((bt_calibration_similar(adci, dai_adci, BT_DCK_BIT_LEN, BT_DCK_TOLERANCE, true))
			 && (bt_calibration_similar(adcq, daq_adcq, BT_DCK_BIT_LEN, BT_DCK_TOLERANCE, true)))
		{
#if DBG_BT_CALIBRATION
			printf("\n\r[BT DCK][%d] DCK OK: ", dck_cnt);
			printf("ADCI = %x, ADCQ = %x, DAI_ACDI = %x, DAQ_ADCQ = %x",
				   adci, adcq, dai_adci, daq_adcq);
#endif
			dck_ok = 1;
		}
		else {
#if DBG_BT_CALIBRATION
			printf("\n\r***********************[DCK Error]***********************");
			printf("\n\r[BT DCK][%d] DCK fail: ", dck_cnt);
			printf("ADCI = %x, ADCQ = %x, DAI_ACDI = %x, DAQ_ADCQ = %x",
				   adci, adcq, dai_adci, daq_adcq);
#endif
			dck_ok = 0;
			if (dck_cnt == 100) {
				printf("\n\r[BT DCK] DCK Error 100 times. Please reboot.");
				while (1);
			}
		}
	}
#if DBG_BT_CALIBRATION
	printf("\n\r[BT DCK] DCK run %d time(s) %s", dck_cnt, dck_ok? "OK":"FAIL");
#endif
}


void phy_bt_dck_write_8710c(void *dm_void, uint8_t q_dck, uint8_t i_dck)
{
	struct dm_struct *dm = (struct dm_struct *)dm_void;
	
	odm_set_bb_reg(dm, R_0x998, 0x00000001, 0x1);
	odm_set_bb_reg(dm, R_0x994, 0x00000001, 0x1);
	
	odm_set_bb_reg(dm, R_0x98c, 0x01000000, 1);
	odm_set_bb_reg(dm, R_0x998, 0x01000000, 1);
	odm_set_bb_reg(dm, R_0x98c, 0x00200000, 1);
	odm_set_bb_reg(dm, R_0x998, 0x00200000, 1);
	odm_set_bb_reg(dm, R_0x98c, 0x02000000, 1);
	odm_set_bb_reg(dm, R_0x998, 0x02000000, 1);
	
	odm_set_bb_reg(dm, R_0x98c, 0x00007c00, 0x1f);
	odm_set_bb_reg(dm, R_0x98c, 0x00000200, 0x1);
	
	odm_set_bb_reg(dm, R_0x98c, 0x001F8000, i_dck);
	
	odm_set_bb_reg(dm, R_0x998, 0x00007c00, 0x1f);
	odm_set_bb_reg(dm, R_0x998, 0x00000200, 0x1);
	
	odm_set_bb_reg(dm, R_0x998, 0x001F8000, q_dck);
	
	odm_set_bb_reg(dm, R_0x998, 0x00000001, 0x0);
	odm_set_bb_reg(dm, R_0x994, 0x00000001, 0x0);
}

uint32_t bt_dck_write(uint8_t q_dck, uint8_t i_dck)
{
	struct net_device *dev;
	_adapter *padapter;
	PHAL_DATA_TYPE pHalData;
	u32 ret = _SUCCESS;
	
	dev = rltk_wlan_info[0].dev;
	if(dev) {
		padapter = (_adapter *)rtw_netdev_priv(dev);
		pHalData = GET_HAL_DATA(padapter);
		LeaveAllPowerSaveMode(padapter);
		
		if ( Hal_BT_Is_Supported(padapter) ) {
			phy_bt_dck_write_8710c(&(pHalData->odmpriv),q_dck,i_dck);
		}
		else {
			ret = _FAIL;
			DBG_ERR("BT not supported\n\r");
		}
	} else {
		ret = _FAIL;
		DBG_ERR("netif is DOWN");
	}

	return ret;
}

uint32_t bt_adda_dck_8710c(void)
{
	struct net_device *dev;
	_adapter *padapter;
	PHAL_DATA_TYPE pHalData;
	uint32_t ret = _SUCCESS;
	
	dev = rltk_wlan_info[0].dev;
	if(dev) {
		padapter = (_adapter *)rtw_netdev_priv(dev);
		pHalData = GET_HAL_DATA(padapter);
		LeaveAllPowerSaveMode(padapter);
		
		if ( Hal_BT_Is_Supported(padapter) ) {
			phy_bt_adda_dck_8710c(&(pHalData->odmpriv));
		}
		else {
			ret = _FAIL;
			DBG_ERR("BT not supported\n\r");
		}
	}
	else {
		ret = _FAIL;
		DBG_ERR("netif is DOWN");
	}
	return ret;
}
uint32_t bt_lok_write(uint16_t idac, uint16_t qdac, uint16_t idac2, uint16_t qdac2)
{
	struct net_device *dev;
	_adapter *padapter;
	PHAL_DATA_TYPE pHalData;
	uint32_t ret = _SUCCESS;
	
	dev = rltk_wlan_info[0].dev;
	if(dev) {
		padapter = (_adapter *)rtw_netdev_priv(dev);
		pHalData = GET_HAL_DATA(padapter);
		LeaveAllPowerSaveMode(padapter);
		
		if ( Hal_BT_Is_Supported(padapter) ) {
			phy_bt_lok_write_8710c(&(pHalData->odmpriv), idac, qdac, idac2, qdac2);
		}
		else {
			phy_bt_lok_write_8710c(&(pHalData->odmpriv), 0, 0, 0, 0);
			ret = _FAIL;
			DBG_ERR("BT not supported\n\r");
		}
	}
	else {
		ret = _FAIL;
		DBG_ERR("netif is DOWN");
	}
	
	return ret;
}

bool select_iqk(uint32_t* iqk_array, int num, uint32_t* selected)
{
	uint8_t median_idx = (num/2);
	sort_iqk(iqk_array, num);
	
	if (bt_calibration_similar(iqk_array[0], iqk_array[num-1], BT_IQK_BIT_LEN, BT_IQK_TOLERANCE, true))
	{
		*selected = iqk_array[median_idx];
		return true;
	}
	else {
		return false;
	}
}

bool select_lok(uint16_t* lok_array, int num, uint16_t* selected)
{
	uint8_t median_idx = (num/2);
	sort_lok(lok_array, num);
	
	if (bt_calibration_similar(lok_array[0], lok_array[num-1], BT_LOK_BIT_LEN, BT_IQK_TOLERANCE, false))
	{
		*selected = lok_array[median_idx];
		return true;
	}
	else {
		return false;
	}
}

uint64_t bt_iqk_lok_8710c(void *dm_void)
{
	uint64_t result_u64;
	uint64_t selected_u64;
	int candidate_num = BT_IQK_CANDIDATE_NUM;
	BT_Cali_TypeDef result[BT_IQK_CANDIDATE_NUM];
	BT_Cali_TypeDef defaul_value = {0x100,0x00,0x20,0x20,0x20,0x20}; // default value
	BT_Cali_TypeDef selected = defaul_value;
	uint32_t iqk_array[2][BT_IQK_CANDIDATE_NUM]; // IQK_XX, IQK_YY
	uint16_t lok_array[4][BT_IQK_CANDIDATE_NUM]; // QDAC, IDAC, QDAC2, IDAC2
	bool calibration_valid[6] = {true, true, true, true, true, true};			// IQK_XX, IQK_YY, QDAC, IDAC, QDAC2, IDAC2
	bool calibration_status[6] = {false, false, false, false, false, false};	// IQK_XX, IQK_YY, QDAC, IDAC, QDAC2, IDAC2
	bool calibration_all_vaid = false;
	const char *name[]  = {"IQK_xx","IQK_yy","QDAC","IDAC","QDAC2","IDAC2"};
	int i=0, iqk_cnt = 0;
	while ( (!calibration_all_vaid) && (iqk_cnt < BT_IQK_MAX_RETRY) ) {
		// Do calibration
		iqk_cnt ++;
		for(i=0; i < BT_IQK_CANDIDATE_NUM; i++) {
			result_u64 = phy_bt_iqk_lok_8710c(dm_void);
			result[i] = calibration_data_conversion_struct(result_u64);
#if DBG_BT_CALIBRATION
			printf("\n\r[BT IQK][%d] IQK_xx = 0x%x, IQK_yy = 0x%x, QDAC = 0x%x, IDAC = 0x%x, QDAC2 = 0x%x, IDAC2 = 0x%x",
				   i, result[i].IQK_xx, result[i].IQK_yy, result[i].QDAC, result[i].IDAC, result[i].QDAC2, result[i].IDAC2);
#endif
			iqk_array[0][i] = result[i].IQK_xx;
			iqk_array[1][i] = result[i].IQK_yy;
			lok_array[0][i] = result[i].QDAC;
			lok_array[1][i] = result[i].IDAC;
			lok_array[2][i] = result[i].QDAC2;
			lok_array[3][i] = result[i].IDAC2;
		}
		
		// Check IQK candidate range <= BT_IQK_TOLERANCE indivdually
		for(i = 0; i < 2; i++) {
			if (calibration_status[i] == false) {
				uint32_t* iqk_ptr = (i==0)? (&selected.IQK_xx) : (&selected.IQK_yy);
				calibration_status[i] = select_iqk(iqk_array[i], BT_IQK_CANDIDATE_NUM, iqk_ptr);
			}
		}
		
		// Check LOK candidate range <= BT_IQK_TOLERANCE indivdually
		for(i = 0; i < 4; i++) {
			if (calibration_status[i+2] == false) {
				uint16_t* lok_ptr = (i==0)? (&selected.QDAC) :
									(i==1)? (&selected.IDAC) :
									(i==2)? (&selected.QDAC2) : (&selected.IDAC2);
				calibration_status[i+2] = select_lok(lok_array[i], candidate_num, lok_ptr);
			}
		}
		
		if (!memcmp(calibration_status, calibration_valid, sizeof(calibration_status))) {
			// All calibration done, exit retry loop
			calibration_all_vaid = true;
			break;
		}
		else {
#if DBG_BT_CALIBRATION
			printf("\n\r***********************[IQK FAIL]***********************");
			/* Debug MSG */
			for(i=0; i<6; i++) {
				if (!calibration_status[i]) {
					printf("\n\r[BT IQK][%d] %s fail", i, name[i]); 
				}
			}
#endif
		}
	}
	
	if (!calibration_all_vaid) {
#if DBG_BT_CALIBRATION
		printf("\n\r***********************[_IQK_]***********************");
#endif
		for(i=0; i<6; i++) {
			if (!calibration_status[i]) {
				printf("\n\r[BT IQK][Warning] %s fail, use default value", name[i]); 
			}
		}
	}
#if DBG_BT_CALIBRATION
	printf("\n\r[BT IQK][Selected] IQK_xx = 0x%x, IQK_yy = 0x%x, QDAC = 0x%x, IDAC = 0x%x, QDAC2 = 0x%x, IDAC2 = 0x%x",
		   selected.IQK_xx, selected.IQK_yy, selected.QDAC, selected.IDAC, selected.QDAC2, selected.IDAC2);
#endif	
	selected_u64 = calibration_data_conversion_u64(selected);

	return selected_u64;
}

