ambiot/amazon-freertos/lib/third_party/mcu_vendor/realtek/component/common/bluetooth/realtek/sdk/board/amebaz2/src/rtl8710c_bt_calibration.c
uint64_t phy_bt_iqk_8710c(void *dm_void)
{
	struct dm_struct *dm = (struct dm_struct *)dm_void;
	uint64_t result;
	
	uint32_t bb_backup_reg[BT_IQK_BACKUP_BB_REG_NUM] = {R_0x88c, R_0x880, R_0x888, R_0xc08, R_0xc04, R_0x908, R_0x950, 0x074};
	uint32_t bb_backup_val[BT_IQK_BACKUP_BB_REG_NUM];
	
	uint32_t rf_backup_reg[BT_IQK_BACKUP_RF_REG_NUM] = {RF_0xde, RF_0x1, RF_0xef};
	uint32_t rf_backup_val[BT_IQK_BACKUP_RF_REG_NUM];
	
	RF_DBG(dm, DBG_RF_IQK, "[BT_IQK] Start IQK LOK");
	
	_bt_backup_bb_registers_8710c(dm, bb_backup_reg, bb_backup_val, BT_IQK_BACKUP_BB_REG_NUM);
	_bt_backup_rf_registers_8710c(dm, rf_backup_reg, rf_backup_val, BT_IQK_BACKUP_RF_REG_NUM);
	
	GNT_BT_to_wifi();
	disable_pta();
	
	RF_DBG(dm, DBG_RF_IQK, "[BT_IQK] Start DCK");
	//phy_bt_adda_dck_8710c(dm);
	
	ODM_delay_ms(BT_IQK_DELAY_TIME);
	result = bt_iqk_lok_8710c(dm);
	
	_bt_reload_bb_registers_8710c(dm, bb_backup_reg, bb_backup_val, BT_IQK_BACKUP_BB_REG_NUM);
	_bt_reload_rf_registers_8710c(dm, rf_backup_reg, rf_backup_val, BT_IQK_BACKUP_RF_REG_NUM);
	RF_DBG(dm, DBG_RF_IQK, "[BT_IQK] IQK LOK end");
	
	return result;
}

uint32_t bt_iqk_8710c(BT_Cali_TypeDef *cal_data, BOOLEAN store)
{
	//printf("\n\rbt_iqk_8710c---------------->\n\r");
	struct net_device *dev;
	_adapter *padapter;
	PHAL_DATA_TYPE pHalData;
	uint64_t result;
	uint32_t ret = _SUCCESS;
	flash_t flash;
	
	dev = rltk_wlan_info[0].dev;
	if(dev) {
		padapter = (_adapter *)rtw_netdev_priv(dev);
		pHalData = GET_HAL_DATA(padapter);
		LeaveAllPowerSaveMode(padapter);
		
		if ( Hal_BT_Is_Supported(padapter) ) {
			result = phy_bt_iqk_8710c(&(pHalData->odmpriv));
			//get calibration data
			if(cal_data) {
				*cal_data = calibration_data_conversion_struct(result);
			}
			
			if(store) {
				if((HAL_READ32(SPI_FLASH_BASE, FLASH_BT_PARA_ADDR) == 0xFFFFFFFF) && (cal_data))
					flash_stream_write(&flash, FLASH_BT_PARA_ADDR, sizeof(BT_Cali_TypeDef), (uint8_t*)cal_data);
				else
					ret =_FAIL;
			}
		}
		else {
			ret = _FAIL;
			DBG_ERR("BT not supported\n\r");
		}
	}
	else {
		ret =_FAIL;
		DBG_ERR("netif is DOWN");
	}
	return ret;
}

void phy_bt_flatk_8710c(struct dm_struct *dm, uint16_t txgain_flatk)
{
	uint8_t txgain_flak_use;
	uint8_t txgaink_flag;
	uint8_t temp = 0;
	
	txgaink_flag = (signed_value_conversion((txgain_flatk>>0&0x0f), 4) <= 2) &&
		(signed_value_conversion((txgain_flatk>>4&0x0f), 4) <= 2) &&
		(signed_value_conversion((txgain_flatk>>8&0x0f), 4) <= 2) &&
		(signed_value_conversion((txgain_flatk>>12&0x0f), 4) <= 2);

	odm_set_rf_reg(dm, RF_PATH_A, RF_0xee, BIT17, 0x1);
	for(int i = 0; i<4; i++) {
		odm_set_rf_reg(dm, RF_PATH_A, RF_0x30, BIT(12)|BIT(13), i);
		txgain_flak_use = (txgain_flatk>>(i*4)) & 0x0f ;
		if(txgaink_flag)
			txgain_flak_use +=2;
		if(txgain_flak_use == 0x07)
			txgain_flak_use =0x06;
		temp = (((txgain_flak_use>>1) + (txgain_flak_use&0x01)) & 0x07);
		odm_set_rf_reg(dm, RF_PATH_A, RF_0x30, BIT2|BIT1|BIT0, temp);
	}
	odm_set_rf_reg(dm, RF_PATH_A, RF_0xee, BIT17, 0x0);
}

uint32_t bt_flatk_8710c(uint16_t txgain_flatk)
{
	//printf("\n\rbt_flatk_8710c---------------->\n\r");
	struct net_device *dev;
	_adapter *padapter;
	PHAL_DATA_TYPE pHalData;
	uint64_t result;
	uint32_t ret = _SUCCESS;
	flash_t flash;
	
	dev = rltk_wlan_info[0].dev;
	if(dev) {
		padapter = (_adapter *)rtw_netdev_priv(dev);
		pHalData = GET_HAL_DATA(padapter);
		LeaveAllPowerSaveMode(padapter);
		
		if ( Hal_BT_Is_Supported(padapter) ) {
			phy_bt_flatk_8710c(&(pHalData->odmpriv), txgain_flatk);
		}
		else {
			ret = _FAIL;
			DBG_ERR("BT not supported\n\r");
		}
	}
	else {
		ret =_FAIL;
		DBG_ERR("netif is DOWN");
	}
	return ret;
}
